feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC37A/_Reg/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_SIES_Bits.MBSIE */
#define IFX_ERAY_SIES_MBSIE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.MBSIE */
#define IFX_ERAY_SIES_MBSIE_OFF (14u)

/** \brief Length for Ifx_ERAY_SIES_Bits.SDSE */
#define IFX_ERAY_SIES_SDSE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.SDSE */
#define IFX_ERAY_SIES_SDSE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.SDSE */
#define IFX_ERAY_SIES_SDSE_OFF (15u)

/** \brief Length for Ifx_ERAY_SIES_Bits.WUPAE */
#define IFX_ERAY_SIES_WUPAE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.WUPAE */
#define IFX_ERAY_SIES_WUPAE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.WUPAE */
#define IFX_ERAY_SIES_WUPAE_OFF (16u)

/** \brief Length for Ifx_ERAY_SIES_Bits.MTSAE */
#define IFX_ERAY_SIES_MTSAE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.MTSAE */
#define IFX_ERAY_SIES_MTSAE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.MTSAE */
#define IFX_ERAY_SIES_MTSAE_OFF (17u)

/** \brief Length for Ifx_ERAY_SIES_Bits.WUPBE */
#define IFX_ERAY_SIES_WUPBE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.WUPBE */
#define IFX_ERAY_SIES_WUPBE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.WUPBE */
#define IFX_ERAY_SIES_WUPBE_OFF (24u)

/** \brief Length for Ifx_ERAY_SIES_Bits.MTSBE */
#define IFX_ERAY_SIES_MTSBE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.MTSBE */
#define IFX_ERAY_SIES_MTSBE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.MTSBE */
#define IFX_ERAY_SIES_MTSBE_OFF (25u)

/** \brief Length for Ifx_ERAY_SIER_Bits.WSTE */
#define IFX_ERAY_SIER_WSTE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.WSTE */
#define IFX_ERAY_SIER_WSTE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.WSTE */
#define IFX_ERAY_SIER_WSTE_OFF (0u)

/** \brief Length for Ifx_ERAY_SIER_Bits.CASE */
#define IFX_ERAY_SIER_CASE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.CASE */
#define IFX_ERAY_SIER_CASE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.CASE */
#define IFX_ERAY_SIER_CASE_OFF (1u)

/** \brief Length for Ifx_ERAY_SIER_Bits.CYCSE */
#define IFX_ERAY_SIER_CYCSE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.CYCSE */
#define IFX_ERAY_SIER_CYCSE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.CYCSE */
#define IFX_ERAY_SIER_CYCSE_OFF (2u)

/** \brief Length for Ifx_ERAY_SIER_Bits.TXIE */
#define IFX_ERAY_SIER_TXIE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.TXIE */
#define IFX_ERAY_SIER_TXIE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.TXIE */
#define IFX_ERAY_SIER_TXIE_OFF (3u)

/** \brief Length for Ifx_ERAY_SIER_Bits.RXIE */
#define IFX_ERAY_SIER_RXIE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.RXIE */
#define IFX_ERAY_SIER_RXIE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.RXIE */
#define IFX_ERAY_SIER_RXIE_OFF (4u)

/** \brief Length for Ifx_ERAY_SIER_Bits.RFNEE */
#define IFX_ERAY_SIER_RFNEE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.RFNEE */
#define IFX_ERAY_SIER_RFNEE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.RFNEE */
#define IFX_ERAY_SIER_RFNEE_OFF (5u)

/** \brief Length for Ifx_ERAY_SIER_Bits.RFCLE */
#define IFX_ERAY_SIER_RFCLE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.RFCLE */
#define IFX_ERAY_SIER_RFCLE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.RFCLE */
#define IFX_ERAY_SIER_RFCLE_OFF (6u)

/** \brief Length for Ifx_ERAY_SIER_Bits.NMVCE */
#define IFX_ERAY_SIER_NMVCE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.NMVCE */
#define IFX_ERAY_SIER_NMVCE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.NMVCE */
#define IFX_ERAY_SIER_NMVCE_OFF (7u)

/** \brief Length for Ifx_ERAY_SIER_Bits.TI0E */
#define IFX_ERAY_SIER_TI0E_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.TI0E */
#define IFX_ERAY_SIER_TI0E_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.TI0E */
#define IFX_ERAY_SIER_TI0E_OFF (8u)

/** \brief Length for Ifx_ERAY_SIER_Bits.TI1E */
#define IFX_ERAY_SIER_TI1E_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.TI1E */
#define IFX_ERAY_SIER_TI1E_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.TI1E */
#define IFX_ERAY_SIER_TI1E_OFF (9u)

/** \brief Length for Ifx_ERAY_SIER_Bits.TIBCE */
#define IFX_ERAY_SIER_TIBCE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.TIBCE */
#define IFX_ERAY_SIER_TIBCE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.TIBCE */
#define IFX_ERAY_SIER_TIBCE_OFF (10u)

/** \brief Length for Ifx_ERAY_SIER_Bits.TOBCE */
#define IFX_ERAY_SIER_TOBCE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.TOBCE */
#define IFX_ERAY_SIER_TOBCE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.TOBCE */
#define IFX_ERAY_SIER_TOBCE_OFF (11u)

/** \brief Length for Ifx_ERAY_SIER_Bits.SWEE */
#define IFX_ERAY_SIER_SWEE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.SWEE */
#define IFX_ERAY_SIER_SWEE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.SWEE */
#define IFX_ERAY_SIER_SWEE_OFF (12u)

/** \brief Length for Ifx_ERAY_SIER_Bits.SUCSE */
#define IFX_ERAY_SIER_SUCSE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.SUCSE */
#define IFX_ERAY_SIER_SUCSE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.SUCSE */
#define IFX_ERAY_SIER_SUCSE_OFF (13u)

/** \brief Length for Ifx_ERAY_SIER_Bits.MBSIE */
#define IFX_ERAY_SIER_MBSIE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.MBSIE */
#define IFX_ERAY_SIER_MBSIE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.MBSIE */
#define IFX_ERAY_SIER_MBSIE_OFF (14u)

/** \brief Length for Ifx_ERAY_SIER_Bits.SDSE */
#define IFX_ERAY_SIER_SDSE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.SDSE */
#define IFX_ERAY_SIER_SDSE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.SDSE */
#define IFX_ERAY_SIER_SDSE_OFF (15u)

/** \brief Length for Ifx_ERAY_SIER_Bits.WUPAE */
#define IFX_ERAY_SIER_WUPAE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.WUPAE */
#define IFX_ERAY_SIER_WUPAE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.WUPAE */
#define IFX_ERAY_SIER_WUPAE_OFF (16u)

/** \brief Length for Ifx_ERAY_SIER_Bits.MTSAE */
#define IFX_ERAY_SIER_MTSAE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.MTSAE */
#define IFX_ERAY_SIER_MTSAE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.MTSAE */
#define IFX_ERAY_SIER_MTSAE_OFF (17u)

/** \brief Length for Ifx_ERAY_SIER_Bits.WUPBE */
#define IFX_ERAY_SIER_WUPBE_LEN (1u)

