feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC37A/_Reg/IfxEray_bf.h
/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP64 */
#define IFX_ERAY_NDIC3_NDIP64_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP64 */
#define IFX_ERAY_NDIC3_NDIP64_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP64 */
#define IFX_ERAY_NDIC3_NDIP64_OFF (0u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP65 */
#define IFX_ERAY_NDIC3_NDIP65_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP65 */
#define IFX_ERAY_NDIC3_NDIP65_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP65 */
#define IFX_ERAY_NDIC3_NDIP65_OFF (1u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP66 */
#define IFX_ERAY_NDIC3_NDIP66_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP66 */
#define IFX_ERAY_NDIC3_NDIP66_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP66 */
#define IFX_ERAY_NDIC3_NDIP66_OFF (2u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP67 */
#define IFX_ERAY_NDIC3_NDIP67_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP67 */
#define IFX_ERAY_NDIC3_NDIP67_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP67 */
#define IFX_ERAY_NDIC3_NDIP67_OFF (3u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP68 */
#define IFX_ERAY_NDIC3_NDIP68_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP68 */
#define IFX_ERAY_NDIC3_NDIP68_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP68 */
#define IFX_ERAY_NDIC3_NDIP68_OFF (4u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP69 */
#define IFX_ERAY_NDIC3_NDIP69_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP69 */
#define IFX_ERAY_NDIC3_NDIP69_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP69 */
#define IFX_ERAY_NDIC3_NDIP69_OFF (5u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP70 */
#define IFX_ERAY_NDIC3_NDIP70_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP70 */
#define IFX_ERAY_NDIC3_NDIP70_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP70 */
#define IFX_ERAY_NDIC3_NDIP70_OFF (6u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP71 */
#define IFX_ERAY_NDIC3_NDIP71_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP71 */
#define IFX_ERAY_NDIC3_NDIP71_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP71 */
#define IFX_ERAY_NDIC3_NDIP71_OFF (7u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP72 */
#define IFX_ERAY_NDIC3_NDIP72_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP72 */
#define IFX_ERAY_NDIC3_NDIP72_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP72 */
#define IFX_ERAY_NDIC3_NDIP72_OFF (8u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP73 */
#define IFX_ERAY_NDIC3_NDIP73_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP73 */
#define IFX_ERAY_NDIC3_NDIP73_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP73 */
#define IFX_ERAY_NDIC3_NDIP73_OFF (9u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP74 */
#define IFX_ERAY_NDIC3_NDIP74_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP74 */
#define IFX_ERAY_NDIC3_NDIP74_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP74 */
#define IFX_ERAY_NDIC3_NDIP74_OFF (10u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP75 */
#define IFX_ERAY_NDIC3_NDIP75_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP75 */
#define IFX_ERAY_NDIC3_NDIP75_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP75 */
#define IFX_ERAY_NDIC3_NDIP75_OFF (11u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP76 */
#define IFX_ERAY_NDIC3_NDIP76_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP76 */
#define IFX_ERAY_NDIC3_NDIP76_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP76 */
#define IFX_ERAY_NDIC3_NDIP76_OFF (12u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP77 */
#define IFX_ERAY_NDIC3_NDIP77_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP77 */
#define IFX_ERAY_NDIC3_NDIP77_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP77 */
#define IFX_ERAY_NDIC3_NDIP77_OFF (13u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP78 */
#define IFX_ERAY_NDIC3_NDIP78_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP78 */
#define IFX_ERAY_NDIC3_NDIP78_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP78 */
#define IFX_ERAY_NDIC3_NDIP78_OFF (14u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP79 */
#define IFX_ERAY_NDIC3_NDIP79_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP79 */
#define IFX_ERAY_NDIC3_NDIP79_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP79 */
#define IFX_ERAY_NDIC3_NDIP79_OFF (15u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP80 */
#define IFX_ERAY_NDIC3_NDIP80_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP80 */
#define IFX_ERAY_NDIC3_NDIP80_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP80 */
#define IFX_ERAY_NDIC3_NDIP80_OFF (16u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP81 */
#define IFX_ERAY_NDIC3_NDIP81_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP81 */
#define IFX_ERAY_NDIC3_NDIP81_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP81 */
#define IFX_ERAY_NDIC3_NDIP81_OFF (17u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP82 */
#define IFX_ERAY_NDIC3_NDIP82_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP82 */
#define IFX_ERAY_NDIC3_NDIP82_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP82 */
#define IFX_ERAY_NDIC3_NDIP82_OFF (18u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP83 */
#define IFX_ERAY_NDIC3_NDIP83_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP83 */
#define IFX_ERAY_NDIC3_NDIP83_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP83 */
#define IFX_ERAY_NDIC3_NDIP83_OFF (19u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP84 */
#define IFX_ERAY_NDIC3_NDIP84_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP84 */
#define IFX_ERAY_NDIC3_NDIP84_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP84 */
#define IFX_ERAY_NDIC3_NDIP84_OFF (20u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP85 */
#define IFX_ERAY_NDIC3_NDIP85_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP85 */
#define IFX_ERAY_NDIC3_NDIP85_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP85 */
#define IFX_ERAY_NDIC3_NDIP85_OFF (21u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP86 */
#define IFX_ERAY_NDIC3_NDIP86_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP86 */
#define IFX_ERAY_NDIC3_NDIP86_MSK (0x1u)

